### Comandos básicos do SQL

In [1]:
# Importando o pandas
import pandas as pd

In [2]:
# Criando a conexão
import sqlite3
con = sqlite3.connect('BaseDados.db')

In [3]:
# Criando um cursor
cur = con.cursor()

In [10]:
# Criando uma função para consultar os dados
def executa_sql(comando):
    cur.execute(comando)
    resultado = cur.fetchall()
    resultado = pd.DataFrame(resultado)
    if resultado.shape[1] > 0:
        resultado.columns = [i[0] for i in cur.description]
    print(resultado.shape)
    display(resultado.head())
    return resultado

### Funções de agregação

In [25]:
# Visualizando a base
resultado_sql = executa_sql('SELECT * FROM dados')

(43, 11)

,index,id_aluno,nome_aluno,cod_matricula,e-mail,acesso_plataforma,acesso_liberado,dias_ultimo_acesso,nr_prova,prova_feita,nota_prova
0,0,1,Maria Eduarda da Rocha,38273,maria@hashtag.com,0,1,12,1,1,9.0
1,1,2,Bárbara da Cunha,63546,barbara@hashtag.com,0,1,2,1,1,10.0
2,2,3,Kevin Melo,80515,kevin@hashtag.com,1,1,3,1,1,7.0
3,3,4,Pedro Henrique da Costa,68004,pedro@hashtag.com,1,1,1,1,1,4.0
4,4,5,Mirella Viana,28421,mirella@hashtag.com,1,1,1,1,1,7.0

In [26]:
# Verificando o valor MÍNIMO da coluna dias_ultimo_acesso
resultado_sql = executa_sql('SELECT MIN(dias_ultimo_acesso) as minimo FROM dados')

(1, 1)

   minimo
0       1

In [27]:
# Verificando o valor MÍNIMO da coluna dias_ultimo_acesso
resultado_sql = executa_sql('SELECT MAX(dias_ultimo_acesso) as maximo FROM dados')

(1, 1)

   maximo
0      14

In [28]:
# Verificando a MÉDIA da coluna dias_ultimo_acesso
resultado_sql = executa_sql('SELECT AVG(dias_ultimo_acesso) as media FROM dados')

(1, 1)

      media
0  5.116279

In [30]:
resultado_sql = executa_sql('SELECT AVG(dias_ultimo_acesso) as media, \
                                    MIN(dias_ultimo_acesso) as minimo, \
                                    MAX(dias_ultimo_acesso) as maximo \
                            FROM dados')

(1, 3)

      media  minimo  maximo
0  5.116279       1      14

### O GROUP BY NO SQL
- O `GROUP BY` permite que a gente agregue os valores das colunas
- Para usar o group by no SQL, vamos passar a `função de agregação` na seleção das colunas e depois usamos o `GROUP BY` após o `WHERE` (quando existir) informando as colunas pelas quais iremos agrupar

In [32]:
resultado_sql = executa_sql('SELECT * FROM dados')

(43, 11)

,index,id_aluno,nome_aluno,cod_matricula,e-mail,acesso_plataforma,acesso_liberado,dias_ultimo_acesso,nr_prova,prova_feita,nota_prova
0,0,1,Maria Eduarda da Rocha,38273,maria@hashtag.com,0,1,12,1,1,9.0
1,1,2,Bárbara da Cunha,63546,barbara@hashtag.com,0,1,2,1,1,10.0
2,2,3,Kevin Melo,80515,kevin@hashtag.com,1,1,3,1,1,7.0
3,3,4,Pedro Henrique da Costa,68004,pedro@hashtag.com,1,1,1,1,1,4.0
4,4,5,Mirella Viana,28421,mirella@hashtag.com,1,1,1,1,1,7.0

In [33]:
# Relembrando o groupby no pandas para verificar quantas vezes cada aluno aparece
resultado_sql.groupby('nome_aluno')['id_aluno'].count()

nome_aluno
Antônio Azevedo            2
Bárbara Freitas            3
Bárbara da Cunha           2
Cauã Porto                 1
Eloah Aragão               5
Francisco Pires            1
Gabriela Costela           2
Isabelly Souza             2
Júlia Pinto                3
Kevin Melo                 2
Lara Lopes                 1
Laura Melo                 2
Lavínia Carvalho           1
Lucca Cardoso              1
Lívia Jesus                2
Maria Eduarda da Rocha     4
Maria Ferreira             3
Melissa Ribeiro            3
Mirella Viana              2
Pedro Henrique da Costa    1
Name: id_aluno, dtype: int64

In [37]:
# Fazendo o group by no SQL para contar a quantidade de linhas por alunos
resultado_sql = executa_sql('SELECT nome_aluno, COUNT(id_aluno) as registros FROM dados GROUP BY nome_aluno')

(20, 2)

         nome_aluno  registros
0   Antônio Azevedo          2
1   Bárbara Freitas          3
2  Bárbara da Cunha          2
3        Cauã Porto          1
4      Eloah Aragão          5

In [38]:
# Fazendo o group by para calcular a média das provas
resultado_sql = executa_sql('SELECT nome_aluno, AVG(nota_prova) as media FROM dados \
                            where nota_prova is not null \
                            GROUP BY nome_aluno')

(15, 2)

         nome_aluno  media
0   Antônio Azevedo    6.0
1   Bárbara Freitas    8.0
2  Bárbara da Cunha   10.0
3      Eloah Aragão    7.5
4  Gabriela Costela    8.0

### O ORDER BY NO SQL
- O `ORDER BY` vai permitir a ordenação do resultado
    - ASC: ascendente
    - DESC: descendente
- Vamos passar o `ORDER BY` logo após o `GROUP BY` (quando existir)

In [40]:
# Ordenando as notas da maior para a menor
resultado_sql = executa_sql('SELECT nome_aluno, AVG(nota_prova) as media FROM dados \
                            where nota_prova is not null \
                            GROUP BY nome_aluno \
                            ORDER BY AVG(nota_prova) desc')

(15, 2)

         nome_aluno  media
0  Bárbara da Cunha   10.0
1   Melissa Ribeiro    8.0
2       Lívia Jesus    8.0
3       Júlia Pinto    8.0
4  Gabriela Costela    8.0